SegundoParcial/Parcial_EjercicioOpenFoam/cavityflujo/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
	(0.25 0 0)
    (0.75 0 0)
    (1 0 0)
    (1 0.25 0)
    (1 0.75 0)
    (1 1 0)
    (0.75 1 0)
    (0.25 1 0)
	(0 1 0)
	(0 0.75 0)
	(0 0.25 0)
	(0.25 0.25 0)
	(0.75 0.25 0)
	(0.75 0.75 0)
	(0.25 0.75 0)
	(0 0 0.1)
	(0.25 0 0.1)
    (0.75 0 0.1)
    (1 0 0.1)
    (1 0.25 0.1)
    (1 0.75 0.1)
    (1 1 0.1)
    (0.75 1 0.1)
    (0.25 1 0.1)
	(0 1 0.1)
	(0 0.75 0.1)
	(0 0.25 0.1)
	(0.25 0.25 0.1)
	(0.75 0.25 0.1)
	(0.75 0.75 0.1)
	(0.25 0.75 0.1)
	
);

blocks
(
    hex (0 1 12 11 16 17 28 27) (10 10 4) simpleGrading (1 1 1)
	hex (1 2 13 12 17 18 29 28) (20 10 4) simpleGrading (1 1 1)
	hex (2 3 4 13 18 19 20 29) (10 10 4) simpleGrading (1 1 1)
	hex (13 4 5 14 29 20 21 30) (10 20 4) simpleGrading (1 1 1)
	hex (14 5 6 7 30 21 22 23) (10 10 4) simpleGrading (1 1 1)
	hex (15 14 7 8 31 30 23 24) (20 10 4) simpleGrading (1 1 1)
	hex (10 15 8 9 26 31 24 25) (10 10 4) simpleGrading (1 1 1)
	hex (11 12 15 10 27 28 31 26) (10 20 4) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    carasuperior
    {
        type wall;
        faces
        (
            (25 24 8 9)
			(24 23 7 8)
			(23 22 6 7)
        );
    }
    lateralizquierda
    {
        type wall;
        faces
        (
            (26 25 9 10)
            (27 26 10 11)
            (16 27 11 0)
        );
    }
    lateralderecha
    {
        type wall;
        faces
        (
            (5 6 22 21)
            (4 5 21 20)
			(3 4 20 19)
        );
    }
	carainferior
	{
        type wall;
        faces
        (
            (0 1 17 16)
            (1 2 18 17)
			(2 3 19 18)
        );
    }
	carainteriores
	{
        type wall;
        faces
        (
            (12 15 31 28)
            (28 29 13 12)
			(29 30 14 13)
			(15 14 30 31)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
